[
    {
        "title": "Week 8-10: Adding Guidance to CLI-style Interface",
        "id": "wk8",
        "date": "April 3, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "For the past two weeks, I improved my CLI-style interface player experience by developing in-game tutorials and creating a retro-style player manual.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk8/Bazaar.log Brochure.jpg"
    },{
        "title": "Week 7: Demo Day Playtesting - Observation, Feedback, and Reflection",
        "id": "wk7",
        "date": "Mar 16, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "This week, I presented my work in progress to a wide range of audience from and outside of IDM. Presentation materials include my online demo, UI design, storyline, and research material from last semester (research report, poster, speculative design, literature review, survey result).",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk7/wk7-featureImg.jpg"
    },{
        "title": "Week 6: Game Refactoring and Naming, UI Design, Midterm Demo, and more Readings",
        "id": "wk6",
        "date": "Mar 10, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "Based on my revised game storyboard created last week, I modified my game structure this week, created more UIs for some key moments in the Internet and open-source history, and started working on my midterm demo, which will consist of UI for two eras: 1970s to 1990s, and 1990s to 2000s. I named my game 'Bazaar.log' for its open-source theme and history-based storyline. Lastly, I read more interesting articles during my research and have some interesting observation to share.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk6/preInternet.jpg"
    },{
        "title": "Week 5: Revised Game Design, and Storyline Update",
        "id": "wk5",
        "date": "Mar 2, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "After this week's science fair demo and following discussions with professors and classmates, I revised my game design and created a storyline in flowchart form. I also did more research on the milestones of the Internet history and open-source history, and did a case study on the funding mode, operation mode, and governance mode of several successful open-source projects.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk5/wk5-wireframe.jpg"
    },{
        "title": "Week 4: Media Theory Reading, and Game UI Update",
        "id": "wk4",
        "date": "Feb 24, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "This week, I read a book and several online articles about the open-source philosophy and the history of user interface, which inspired me a lot on my game logic design and UI design. With these inspirations, I updated my game logic and UI and started to refine my game story.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk4/wk4-featureImg.gif"
    },{
        "title": "Week 3: Starting Game Development",
        "id": "wk3",
        "date": "Feb 18, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "This week, I updated my game UI based on feedback from my friends, classmates, and professors. After UI modifications, I learned the basics of numerical planning and planned the progression of variables based on the game storyline. Then, I started game development using Next.js framework and deployed it on the Vercel platform.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk3/wk3-featureImg.gif"
    },{
        "title": "Week 2: Preliminary Prototype",
        "id": "wk2",
        "date": "Feb 10, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "This week, I designed my prelimilary prototype in storyboard form in Figma, formed a moodboard, and iterated the prototype UI based on suggestions from my friends and ChatGPT.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk2/AI_1.png"
    },
    {
        "title": "Week 1: Ideation",
        "id": "wk1",
        "date": "Jan 31, 2025",
        "tag": "idm-thesis",
        "posted": true,
        "description": "This week, I presented my idea in class, built the project website, and fleshed out my idea into an incremental game with a more detailed storytelling. I've also created a Game Design Document with game design details and a project plan.",
        "featureImgURL": "/imgs/blogs/idm-thesis/wk1-gameDiagram.jpg"
    }
]